---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.BendingDetailSegmentsRepresentation.Unfold
enum: Autodesk.Revit.DB.Structure.BendingDetailSegmentsRepresentation
source: html/bb27708f-110c-f59b-3056-b8c45eabe5f6.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailSegmentsRepresentation.Unfold

Some of the bar segments will be unfolded so there is no intersection between them.